def area(a, b):
    '''
    Реализует подсчёт площади прямоугольника со сторонами a и b

        Параметры:
            a, b (int, float, etc) :  соответствующие стороны прямоугольника

        Возвращаемое значение:
            area (int, float, etc) : площадь прямоугольника
    '''
    return a * b 

def perimeter(a, b):
    '''
    Реализует подсчёт периметра прямоугольника со сторонами a, b

        Параметры:
            a, b (int, float, etc) : соответствующие стороны прямоугольника

        Возвращаемое значение:
            perimeter (int, float, etc) : периметр прямоугольника
    '''
    return 2*(a + b)