
def area(a):
    '''
    Реализует подсчёт площади квадрата со стороной a

        Параметры:
            a (int, float, etc) : длина стороны квадрата

        Возвращаемое значение:
            area (int, float, etc) : площадь квадрата
    '''
    return a * a


def perimeter(a):
    '''
    Реализует нахождение периметра квадрата

        Парметры:
            a (int, float, etc) : длина стороны квадрата

        Возвращаемое значение:
            perimeter (int, float, etc) : периметр квадрата со стороной a
    '''
    return 4 * a
